[
  {
    "query": "When was the Active Liability Management Act certified?",
    "response": "It was certified on the 28th of March, 2018."
  },
  {
    "query": "What is the objective of the Active Liability Management Act?",
    "response": "The objective of the Act is to manage public debt to ensure the financing needs and payment obligations of the Government are met at the lowest possible cost over the medium to long term consistent with a prudent degree of risk."
  },
  {
    "query": "What authority does the Parliament have under the Active Liability Management Act?",
    "response": "The Parliament may approve raising sums of money, not exceeding ten percentum of the total outstanding debt as at the end of the preceding financial year, as a loan for the purpose of refinancing and pre-financing of public debts of the Government."
  },
  {
    "query": "What exemptions are provided under the Active Liability Management Act?",
    "response": "Loans raised for the purposes of refinancing and pre-financing of public debts of the Government are exempted from the application of certain provisions of the Appropriation Act, No. 30 of 2017."
  },
  {
    "query": "What does Section 4 of the Active Liability Management Act pertain to?",
    "response": "Section 4 pertains to the settlement of obligations of the Government."
  },
  {
    "query": "What is the purpose of Section 10 of the Active Liability Management Act?",
    "response": "Section 10 allows the Minister to make regulations, with the advice of the Monetary Board, in respect of matters required by the Act to be prescribed or authorized by the Act."
  },
  {
    "query": "What is the penalty for contravening the Active Liability Management Act?",
    "response": "Any person who contravenes the Act commits an offence and is liable on conviction after summary trial by a Magistrate, to imprisonment for a term not exceeding five years or to a fine not less than three million rupees and not exceeding ten million rupees."
  },

  {
    "query": "Who is responsible for implementing the provisions of the Foreign Exchange Act?",
    "response": "The Central Bank is responsible for implementing the provisions of the Foreign Exchange Act as the agent of the Government."
  },
  {
    "query": "What is the purpose of the Foreign Exchange Act?",
    "response": "The purpose of the Foreign Exchange Act is to provide for the promotion and regulation of foreign exchange, vesting the responsibility for promoting and regulating foreign exchange in the Central Bank as the agent of the Government, and to repeal the Exchange Control Act (Chapter 423), among other matters connected therewith or incidental thereto."
  },
  {
    "query": "Who are authorized to deal in foreign exchange according to the Act?",
    "response": "According to the Act, licensed commercial banks, specialized banks, and certain permitted persons or classes of persons (referred to as restricted dealers) are authorized to deal in foreign exchange, subject to the provisions of the Act."
  },
  {
    "query": "What types of transactions are covered under the Act?",
    "response": "The Act covers both current transactions and capital transactions involving foreign exchange."
  },
  {
    "query": "What are the penalties for non-compliance with the Act?",
    "response": "The Act does not specify penalties for non-compliance directly, but it empowers the Central Bank to refuse transactions and conduct investigations into foreign exchange transactions or foreign assets, and individuals or entities found in violation may be subject to legal action."
  },
  {
    "query": "What is the purpose of the Central Bank of Sri Lanka Act?",
    "response": "The purpose of the Central Bank of Sri Lanka Act, No. 16 of 2023, is to provide for the establishment of the Central Bank of Sri Lanka, repeal the Monetary Law Act (Chapter 422), and address matters connected therewith or incidental thereto."
  },
  {
    "query": "What is the purpose of the Banking (Special Provisions) Act, No. 17 of 2023?",
    "response": "The purpose of the Banking (Special Provisions) Act, No. 17 of 2023, is to provide for the resolution authority of the Central Bank and the resolution measures that can be implemented by the Central Bank and the government of Sri Lanka to resolve licensed banks subject to various risks in a timely manner, among other objectives."
  },
  {
    "query": "What is the Finance Business Act, No. 42 of 2011 about?",
    "response": "The Finance Business Act, No. 42 of 2011, provides for the control and supervision of LFCs (Leasing and Finance Companies) and addresses matters connected therewith or incidental thereto. It repeals and replaces the Finance Companies Act, No. 78 of 1988, to strengthen the regulation and supervision of LFCs and curb unauthorized finance business."
  },
  {
    "query": "What does the Micro Finance Act, No. 6 of 2016 cover?",
    "response": "The Micro Finance Act, No. 6 of 2016, provides for the licensing, regulation, and supervision of companies carrying on microfinance business, as well as the registration of non-governmental organizations accepting limited savings deposits as microfinance non-governmental organizations. It also establishes standards for the regulation and supervision of microfinance non-governmental organizations and microcredit non-governmental organizations, along with addressing matters connected therewith or incidental thereto."
  },
  {
    "query": "What is the Active Liability Management Act, No. 8 of 2018 for?",
    "response": "The Active Liability Management Act, No. 8 of 2018, authorizes the raising of loans in or outside Sri Lanka for the purpose of Active Liability Management to improve public debt management in Sri Lanka. It also makes provisions for matters connected therewith or incidental thereto."
  },
  {
    "query": "What is the Payment and Settlement Systems Act, No. 28 of 2005 about?",
    "response": "The Payment and Settlement Systems Act, No. 28 of 2005, provides for the regulation of payment, clearing, and settlement systems; the disposition of securities on the books of the Central Bank; the regulation of providers of money services; the electronic presentment of cheques; and matters connected therewith or incidental thereto."
  }
]
